SSLD/5-2 5.9 How can we deal with each other's unmet needs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-02-03 Mon 14:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org124a82e" class="outline-2">
<h2 id="org124a82e">5-2 5.9 How can we deal with each other's unmet needs?</h2>
<div class="outline-text-2" id="text-org124a82e">
<p class="verse">
With the interrelationship kind of how do we deal with that acknowledgment and needs not being met?<br />
So yeah, this is the constant SSLD question, you know.<br />
When things change, how do we address our needs within this changed context, right.<br />
And we always talk about you know N3C.<br />
So and when a relationship changes<br />
&#xa0;like we can be related to Like changes in the characteristics of one or both of the partners.<br />
It can be also related to the change in the circumstances and it can also be like changing needs.<br />
So what now we are dealing with is the last C,<br />
&#xa0;that is like building the capacity<br />
&#xa0;&#xa0;to negotiate these changes and the differences created by these changes.<br />
So the key process still will a be very effective open direct communication.<br />
<br />
Okay, with this open direct communication how is that effectively played out in our lives?<br />
Well, first of all, we realized that the purpose is to communicate to the other party that one,<br />
&#xa0;I'm aware of certain changes have happened.<br />
I am like wanting to do the best regarding our relationship,<br />
&#xa0;that can be, you know like negotiating a new pattern of interaction<br />
&#xa0;&#xa0;that is what we call a transformation,<br />
And we can also be like communicating the fact that I want my needs to be met.<br />
I am also respectful of the fact that your needs have to be addressed as well.<br />
So we want to have like an open communication<br />
&#xa0;regarding how the two of us can work together, all right, to make modifications to relationship<br />
&#xa0;&#xa0;so that it would like be functional or helpful or beneficial to both of us.<br />
So that is likely the general spirit and in order to do that,<br />
A key principle is like when we're communicating,<br />
&#xa0;we focus on this intention of helping each other to understand our needs better<br />
&#xa0;&#xa0;and it's not an exercise in you know placing blame, and who has done wrong.<br />
And like whether you owe me or you have done things to hurt me.<br />
Try to stay away from the blaming and accusation.<br />
Right.<br />
But more focused on what are my needs, what are your needs.<br />
</p>
</div>
<div id="outline-container-org5878dc7" class="outline-3">
<h3 id="org5878dc7">expression</h3>
<div class="outline-text-3" id="text-org5878dc7">
<p>
interrelationship [ˌɪntərɪˈleɪʃ(ə)nˌʃɪp]: n. a connection between two things that makes them affect each other相互关系<br />
acknowledgment [əkˈnɑlɪdʒmənt]: n. the act of admitting or accepting that something is true承认,认知<br />
modification [ˌmɑdɪfɪˈkeɪʃ(ə)n]: n. a small change made in something such as a design, plan, or system SYN alteration修改, 修正<br />
</p>
<hr />
<p>
regarding sth.: 关于某事<br />
be respectful of the fact that + &#x2026;: 尊重这个事实 + &#x2026;<br />
stay away from sth./doing sth.: 远离某事/做某事<br />
</p>
</div>
</div>
<div id="outline-container-org32c033a" class="outline-3">
<h3 id="org32c033a">ch.</h3>
<div class="outline-text-3" id="text-org32c033a">
<p>
如何处理彼此未满足的需求？<br />
在这种相互关系中，我们如何处理这种认知和需求未被满足的问题呢？<br />
所以，这就是不断的SSLD问题，你知道的。<br />
当事情发生变化时，我们如何在这个变化的背景下处理我们的需求，对吧？<br />
我们总是谈论N3C。<br />
所以当一段关系发生变化时，它可能与一个或两个伴侣的特征变化有关，也可能与环境的变化有关，甚至可能是需求的变化。<br />
所以现在我们处理的是最后一个C，即建立应对这些变化以及这些变化所带来的差异的能力。<br />
所以关键的过程仍然是非常有效的、开放的直接沟通。<br />
好的，在这种开放直接的沟通中，它如何在我们的生活中有效地体现出来呢？<br />
首先，我们意识到，沟通的目的是让对方知道，首先，我意识到某些变化已经发生。<br />
我是想尽力为我们的关系做得更好，这可以是，像协商一种新的互动模式。<br />
如果那就是我们所说的转变，我们也可以传达这样的事实：我希望我的需求能够得到满足，我也尊重你的需求也必须得到关注。<br />
所以我们想要进行开放的沟通，讨论我们俩如何一起合作，对关系进行调整，使其对我们俩都具有功能性、帮助性或有益性。<br />
这个大致的精神和要做的事情就是这样的。<br />
一个关键原则是，在沟通时，我们专注于帮助彼此更好地理解我们的需求，而不是进行责备和指责，或者讨论是谁错了，谁欠我什么，谁伤害了我。<br />
尽量避免指责和控诉。<br />
对吧？而是更多地关注：我的需求是什么，你的需求是什么。<br />
</p>
</div>
</div>
<div id="outline-container-org925387a" class="outline-3">
<h3 id="org925387a">sentence</h3>
<div class="outline-text-3" id="text-org925387a">
<p>
interrelationship [ˌɪntərɪˈleɪʃ(ə)nˌʃɪp]: n. a connection between two things that makes them affect each other相互关系<br />
</p>
<ul class="org-ul">
<li>With the interrelationship even the monarch can't establish a law prohibiting the rituals in countries.<br /></li>
<li>With the interrelationship both of the fossils would die down more quickly.<br /></li>
<li>With the interrelationship this kind execution that's brutal gradually died down.<br /></li>
</ul>
<p>
acknowledgment [əkˈnɑlɪdʒmənt]: n. the act of admitting or accepting that something is true承认<br />
</p>
<ul class="org-ul">
<li>Your acknowledgment inspired main elements of his dream of being a lawyer.<br /></li>
<li>This acknowledgment enacts the age-old tradition of presenting pocket money to children on New Year's Eve.<br /></li>
<li>It is time to elaborate upon why he gained your acknowledgment.<br /></li>
</ul>
<p>
modification [ˌmɑdɪfɪˈkeɪʃ(ə)n]: n. a small change made in something such as a design, plan, or system SYN alteration修改, 修正<br />
</p>
<ul class="org-ul">
<li>There is a tiny modification on the time of firework displays on New Year's Eve.<br /></li>
<li>The significant modification propelled the crused plane to the surface of the sea.<br /></li>
<li>It is your modification that cause the failure of the potion for immortality.<br /></li>
</ul>
<hr />
<p>
regarding sth.: 关于某事<br />
</p>
<ul class="org-ul">
<li>The chemist was talking about regarding the potion for immortality.<br /></li>
<li>Regarding the disagreement with you and your brother even an eminent judge can't figure it out.<br /></li>
<li>Regarding how to go on a vacation at a seaside resort I must come up with the lack of money.<br /></li>
</ul>
<p>
be respectful of the fact that + &#x2026;: 尊重这个事实 + &#x2026;<br />
</p>
<ul class="org-ul">
<li>She is respectful of the fact that her girl has individuated and become an own person.<br /></li>
<li>I am respectful of the fact that I don't get you out of the trouble.<br /></li>
<li>I am respectful of the fact that my father has to have an operation right now.<br /></li>
</ul>
<p>
stay away from sth./doing sth.: 远离某事/做某事<br />
</p>
<ul class="org-ul">
<li>Staying away from me, you are such a pervert.<br /></li>
<li>Staying away from blaming, both of us settled down and nursed each other on the desert island.<br /></li>
<li>A wise king always stays away from a so-called potion for immortality.<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org6a85fea" class="outline-3">
<h3 id="org6a85fea">sentence2</h3>
<div class="outline-text-3" id="text-org6a85fea">
<p>
interrelationship [ˌɪntərɪˈleɪʃ(ə)nˌʃɪp]: n. a connection between two things that makes them affect each other相互关系<br />
</p>
<ul class="org-ul">
<li>With the interrelationship, even the monarch can't establish a law prohibiting the rituals in countries.<br /></li>
<li>With the interrelationship, both of the fossils would die down more quickly.<br /></li>
<li>With the interrelationship, this kind of execution that's brutal gradually died down.<br /></li>
</ul>
<p>
acknowledgment [əkˈnɑlɪdʒmənt]: n. the act of admitting or accepting that something is true承认<br />
</p>
<ul class="org-ul">
<li>Your acknowledgment inspired the main elements of his dream of being a lawyer.<br /></li>
<li>This acknowledgment enacts the age-old tradition of presenting pocket money to children on New Year's Eve.<br /></li>
<li>It is time to elaborate upon why he gained your acknowledgment.<br /></li>
</ul>
<p>
modification [ˌmɑdɪfɪˈkeɪʃ(ə)n]: n. a small change made in something such as a design, plan, or system SYN alteration修改, 修正<br />
</p>
<ul class="org-ul">
<li>There is a tiny modification on the time of firework displays on New Year's Eve.<br /></li>
<li>The significant modification propelled the crushed plane to the surface of the sea.<br /></li>
<li>It is your modifications that mess all up.<br /></li>
</ul>
<hr />
<p>
regarding sth.: 关于某事<br />
</p>
<ul class="org-ul">
<li>The chemist was talking about raw material regarding the potion for immortality.<br /></li>
<li>Regarding the disagreement with you and your brother even an eminent judge can't figure it out.<br /></li>
<li>Regarding how to go on a vacation at a seaside resort I must come up with the lack of money.<br /></li>
</ul>
<p>
be respectful of the fact that + &#x2026;: 尊重这个事实 + &#x2026;<br />
</p>
<ul class="org-ul">
<li>She is respectful of the fact that her girl has individuated and become her own person.<br /></li>
<li>I am respectful of the fact that I don't get you out of trouble.<br /></li>
<li>I am respectful of the fact that my father has to have an operation right now.<br /></li>
</ul>
<p>
stay away from sth./doing sth.: 远离某事/做某事<br />
</p>
<ul class="org-ul">
<li>Staying away from me, you are such a pervert.<br /></li>
<li>Staying away from blaming, both of us settled down and nursed each other on the desert island.<br /></li>
<li>A wise king always stays away from a so-called potion for immortality.<br /></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
